---
kind: method
id: M:Autodesk.Revit.DB.DirectShapeType.CanChangeFamilyName
source: html/4ebcd220-19aa-3789-672e-18bff44601d2.htm
---
# Autodesk.Revit.DB.DirectShapeType.CanChangeFamilyName Method

Checks whether the DirectShapeType supports a custom family name.

## Syntax (C#)
```csharp
public bool CanChangeFamilyName()
```

## Returns
True if a custom family name is supported, false otherwise.